#ifndef _MOTOR_H_
#define _MOTOR_H_

#include "stm32f4xx.h"
#include "extend.h"

/*电机PWM定义*/
#define PWM1 TIM4->CCR1		//PA0
#define PWM2 TIM4->CCR2		//PA1
#define PWM3 TIM4->CCR3		//PA2
#define PWM4 TIM4->CCR4		//PA3

/*电机控制模式*/
#define FRONT 1		//前
#define REAR  2		//后
#define LEFT  3		//左
#define RIGHT 4		//右
#define STOP  0		//停止


/*********************************************************************************************
移动模式参数
*********************************************************************************************/
/*
0：停止
1：手动
2：寻迹
3：避障
*/
extern u8 motion_mode;

/*********************************************************************************************
电机控制参数
*********************************************************************************************/
extern u8 motor_direction;
extern u16 motor_speed;



/*********************************************************************************************
* 名称：motor_init
* 功能：初始化motor对应的GPIO
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void motor_init(void);

/*********************************************************************************************
* 名称：motor_control
* 功能：电机控制
* 参数：LeftPwm：左边电机PWM值
RightPwm：右边电机PWM值
Mode：运行模式
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void motor_control(u16 LeftPwm,u16 RightPwm,u8 Mode);

#endif